задачник_едт/src/Documents/ВыплатаДенег/ВыплатаДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаДенег</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПартнерами</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСИсполнителями</registerRecords>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПлатежа</name>
    <type>
      <types>CatalogRef.СпособПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>DocumentRef.ЭтапПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ОбращениеВПоддержку</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

задачник_едт/src/AccumulationRegisters/ВзаиморасчетыСИсполнителями/ВзаиморасчетыСИсполнителями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСИсполнителями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаченная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.ОбращениеВПоддержку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/Enums/ВидыРасчета/ВидыРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасчета</name>
  <enumValues>
    <name>СИсполнителями</name>
  </enumValues>
  <enumValues>
    <name>СПартнером</name>
  </enumValues>
  <enumValues>
    <name>СКлиентом</name>
  </enumValues>
</mdclass:Enum>

задачник_едт/src/Documents/ВыплатаДенег/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидРасчета = Перечисления.ВидыРасчета.СИсполнителями;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНераспределеннуюСумму()
	НераспределеннаяСумма = Объект.Сумма - Объект.РасшифровкаПлатежа.Итог("Сумма");
	Элементы.НераспределеннаяСумма.Видимость = (НераспределеннаяСумма <> 0);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПриИзменении(Элемент)
	ОбновитьНераспределеннуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьНераспределеннуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачи(Команда)
	Если Объект.РасшифровкаПлатежа.Количество() Тогда
		ОписаниеЗавершения = Новый ОписаниеОповещения("ЗаполнитьРасшифровкуФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеЗавершения, "Строки будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьРасшифровкуНаСервере();
		ОбновитьНераспределеннуюСумму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуФрагмент(Ответ, Параметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗаполнитьРасшифровкуНаСервере();
	ОбновитьНераспределеннуюСумму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуНаСервере()
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Запрос = Новый Запрос;
	Если Объект.ВидРасчета <> Перечисления.ВидыРасчета.СИсполнителями Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПоИсполнителям();
	Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() И Объект.Сумма > Объект.РасшифровкаПлатежа.Итог("Сумма") Цикл
		НоваяСтрокаРасшифровки = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРасшифровки, Выборка);
		НоваяСтрокаРасшифровки.Сумма = Мин(Объект.Сумма - Объект.РасшифровкаПлатежа.Итог("Сумма"), Выборка.СуммаВыборки)
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоИсполнителям()
	Возврат "ВЫБРАТЬ
	|	ВзаиморасчетыСИсполнителямиОстатки.Задача,
	|	ВзаиморасчетыСИсполнителямиОстатки.СуммаКОплатеОстаток КАК СуммаВыборки
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСИсполнителями.Остатки КАК ВзаиморасчетыСИсполнителямиОстатки
	|ГДЕ
	|	ВзаиморасчетыСИсполнителямиОстатки.Исполнитель = &Исполнитель";
КонецФункции
